[
    {
        "blog_title": "What men's shoes will be in fashion in the spring-summer of 2019",
        "blog_image": "https://smhttp-ssl-64590.nexcesscdn.net/media/magpleasure/mpblog/upload/3/4/34e980fd2e68956c38919226e764e74c.jpg",
        "blog_description": "Men footwear designers focused on practicality and comfort this season. This trend doesn't necessarily mean that you have to forget about the classic style or leather brogues you bought last season. The new trends only set the direction in which the fashion is moving. 2019 spring-summer men shoe trends 1. White Sneakers White sneakers seem to be capricious shoes and it seems hard enough to match clothes with. But the beauty of white sneakers lies in the fact that there is no need to choose anything that will suit them: according to the designers, this shoe fits perfectly into any casual outfit - from jeans to office outfit. 2. Vintage style hiking boots These heavy shoes with wide lacing, are one of the new solutions of the new season. It is important that they do not have a modern look. These type of boots look like they were worn by your father who was going on a regular march. The combination of romance and retro style is exactly what you need to get into the fashion stream. 3. Sporty old school shoes Low sneakers with neutral colors (light, dark, beige, gray. khaki) and without unnecessary futuristic unusual elements are literally an ideal universal footwear for men. And the best and, perhaps, the most loved by designers in 2019 is the combination of old school sneakers with jeans, a plaid shirt, a sweatshirt and a cap. 4. Shoes with contrasting soles Contrast is not only about the color, but also the material, as well as the shape of the sole. Although, stylists warn: these shoes attract attention, and, therefore, they require a restrained and simple style of dressing. Otherwise, the image will be too overloaded with bright elements. 5. Footwear with a heavy corrugated sole Military-style shoes do not go out of fashion for several seasons. Corrugated sole with heavy rubber protectors, like army boots, adorns the most current shoes and brogues. 6. Shoes with a stitched toe  Moccasins are back in fashion. Their characteristic sock firmware with a bold seam is found in the shoes presented in most of the fashion collections of this year. If you are hesitating what shoes or boots to wear, give the preference to the moccasin option - it is really in trend now.  7. Sandals with wide straps.  Brutal hiking or stylish urban sandals for men, made of genuine leather or with nylon straps, classic or bright like neon colors are a must-have for this season. They rhyme not only with shorts and chinos, but also with office style. And also, designers wear socks with these sandals. What was previously considered a weird thing, today it turns into a trend. Whether to follow this trend or not, it's up to you.",
        "category": "New",
        "viwers": "10",
        "reaction": "55"
    },
    {
        "blog_title": "Black Shoes vs. Brown Shoes",
        "blog_image": "https://www.stepshoes.com/media/magpleasure/mpblog/upload/2/6/268e553427c53679bf7e44b75e82ae2c.jpg",
        "blog_description": "There is no single list of men's dress rules that are comprehensive and absolute. Some rules suggest that a man should match the metal of the bit on his loafer with the buckle on his belt with the metal on his suspenders with the buttons on his blazer with the metal of his cufflinks. Then there are some rules that have exceptions, such as the rule that a man's socks should match the color of his pants. Style rules are written in pencil, not ink. Everyone should play around and discover their own style that will show some personality.  Modern men's fashion allows us to use a larger range of colors in our daily wardrobe. Any shoe manufacturer has any shade of green, red, blue, etc. in their product line. Nevertheless, the most versatile colors in men's shoe fashion are black or brown.  There are few situations where you do not have a choice between black and brown shoes. First of all, these are formal events. Here, hardly a brown color will be a good idea to wear. Also, a strict dress code at work will not allow you to put on brown shoes.  However, if you have ever heard the expression “no brown in town” forget about it. Brown shoes are dressy (black ones are dressier though) and quite casual. When you want to decide whether to go with black shoes or brown shoes, consider the following rules. But, again, “rules are made to be broken”.   One of the most important rules is avoid putting brown and black together when pairing suits and shoes, especially a black suit and brown shoes. Brown shoes (brown oxfords' a great choice) will look perfect with a navy blue suit. Brown shades can be everything from dark chocolate to light tan, and it can make your shoes very versatile. Brown shoes look great with earth tone suits, especially navy, grey and blue.  Black shoes are not as versatile as the brown ones, but they are dressier and more classic. They can go well with more urbane or sporty colors. Charcoal and black suits look great with black shoes and make a statement of tidiness when attending more formal events. If your outfit is not black, make sure to wear black watch and black belt with your black shoes.  As for jeans and their combinations with shoes, the brown color is more preferable here. Brown shoes will look great even with black jeans. Just try to pick up a shade darker. Blue jeans will perfectly match with brown shoes of any shade, even if you have a black overcoat at the top.  As always, style is a state of mind. Play around with your outfit. Discover your own style by being creative.",
        "category": "New",
        "viwers": "15",
        "reaction": "55"
    },
    {
        "blog_title": "How To Choose The Right Shoes",
        "blog_image": "https://www.stepshoes.com/media/magpleasure/mpblog/upload/9/d/9d509581bd79156111c6acc65fd1ec03.jpg",
        "blog_description": "When shopping for shoes, you want to have more than fashion in mind. Tight shoes can cause blood circulation disorders, ingrown nails or bending fingers. We often buy shoes, guided by its appearance only. It is important to us how attractive and fashionable the shoes look. However, we should choose our footwear with cautiousness, as our health depends on what footwear we wear.  According to the New York Times, roughly 75 percent of Americans will have to deal with foot pain at some point in their lives. Feet take a lot of pressure throughout the day. Low-quality or simply unsuitable shoes can cause annoying troubles such as calluses. Moreover, they can cause much more serious problems like vein, joint, muscle and even spine diseases. Therefore, make sure the shoe has the right length and width before buying one. Do not buy shoes in the mornings: legs tend to swell slightly in the evenings, and shoes acquired in the morning may seem tight. Make sure that the shoe fits perfectly in size: it fits your foot tightly, but does not squeeze it. Tight shoes can cause blood circulation disorders, ingrown nails or bending fingers. Shoes that are loose on your feet are not recommended either as they will keep the leg muscles constantly stressed. Experts recommend to try on both shoes when fitting. Stand in the shoes and press gently on the top of the shoe to make sure you have about a half-inch of space between your longest toe and the end of the shoe. This provides enough room for your foot to press forward as you walk. Wiggle your toes to make sure there's enough room. Walk around in the shoes to determine how they feel.  Choose the shoes that have flexible and soft enough insole. Bend the shoes. Quality footwear has an insole that easily bends while the top of the shoe does not deform too much. The best choice for everyday wear is the shoe that has a small wide heel. Shoe material also plays a huge role when choosing a pair. Shoes made of natural material will allow the skin of your feet breathe in any season. We recommend shoes made of grain leather, nubuck, and suede. Shoes made from leatherette can be dangerous to health, especially if they are summer shoes. Temperature fluctuations make various chemical components of this material interact with the skin of the feet. In addition, shoes from leatherette do not allow airflow. As a result, you can get diaper rash or fungal diseases. If you still buy shoes from artificial materials, make sure that at least the shoe lining is made of grain leather or textiles. Also pay attention to the insole material. Ideally, it should absorb unpleasant odors, remove moisture and kill bacteria.  Different shoes are appropriate for different activities. The important thing is that you know your lifestyle, and pick footwear that fits within it.",
        "category": "New",
        "viwers": "110",
        "reaction": "55"
    }
]